(a) Following dataset is given in the Q3a.csv file.

Without making any change to the original source (given file), filling the missing values programmatically as follows.
(i) Replace the missing values in DSA 501 3.0 column by its mean marks.
(ii) Replace the missing values in DSA 503 3.0 column by the mean marks of the respective row.
(iii) Add a new column name "avg" to the above dataset. Compute the average marks of each student and add them to the "avg" column.
(IV) Find and display the mean, median and the standard deviation of each course unit.

In [11]:
import pandas as pd

In [12]:
df = pd.read_csv("data/Q3a.csv")

In [13]:
df.head()

      IndexNo  DSA 501 3.0  DSA 502 2.0  DSA 503 3.0
0  GS/DSA/001         35.0           97          NaN
1  GS/DSA/002          NaN           32         77.0
2  GS/DSA/003         73.0           62          NaN
3  GS/DSA/004         82.0           81         67.0

In [14]:
df.shape

(4, 4)

In [15]:
#Replace the missing values in DSA 501 3.0 column by its mean marks.
dsa_501_mean = df['DSA 501 3.0'].mean()
df['DSA 501 3.0'].fillna(dsa_501_mean, inplace=True)
df.head()

      IndexNo  DSA 501 3.0  DSA 502 2.0  DSA 503 3.0
0  GS/DSA/001    35.000000           97          NaN
1  GS/DSA/002    63.333333           32         77.0
2  GS/DSA/003    73.000000           62          NaN
3  GS/DSA/004    82.000000           81         67.0

In [16]:
#Replace the missing values in DSA 503 3.0 column by the mean marks of the respective row.
df['DSA 503 3.0'].fillna(df.mean(axis=1), inplace=True)
df.head()

C:\Users\ACER\AppData\Local\Temp/ipykernel_12572/2087323083.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df['DSA 503 3.0'].fillna(df.mean(axis=1), inplace=True)

      IndexNo  DSA 501 3.0  DSA 502 2.0  DSA 503 3.0
0  GS/DSA/001    35.000000           97         66.0
1  GS/DSA/002    63.333333           32         77.0
2  GS/DSA/003    73.000000           62         67.5
3  GS/DSA/004    82.000000           81         67.0

In [18]:
#Add a new column named "avg" to the dataset and compute the average marks of each student.
df['avg'] = df.mean(axis=1)
df.head()

C:\Users\ACER\AppData\Local\Temp/ipykernel_12572/951405444.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df['avg'] = df.mean(axis=1)

      IndexNo  DSA 501 3.0  DSA 502 2.0  DSA 503 3.0        avg
0  GS/DSA/001    35.000000           97         66.0  66.000000
1  GS/DSA/002    63.333333           32         77.0  57.444444
2  GS/DSA/003    73.000000           62         67.5  67.500000
3  GS/DSA/004    82.000000           81         67.0  76.666667

In [ ]:
#Find and display the mean, median, and standard deviation of each course unit.
mean_values = df.mean()
median_values = df.median()
std_dev_values = df.std()

print("Mean values:",  )